openssl-fingerprints.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-01 Wed 17:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>calculating cert fingerprints with openssl</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">calculating cert fingerprints with openssl</h1>
<p>
some of the x509 certificate fingerprint algorithms used for certfp
authentication on irc are weirdly hard to find documentation
for. solanum's <code>solanum-mkfingerprint</code> utility can easily calculate
these, but it can be rather annoying to compile without using the rest
of solanum too. it is a bit more finicky but we can just use the
<code>openssl</code> utility to calculate them instead.
</p>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> normal fingerprints</h2>
<div class="outline-text-2" id="text-1">
<p>
sha1, sha256, and sha512 fingerprints are just hashes for the cert in
der form using that hash algorithm. for example to get the sha512
fingerprint (which is what libera.chat uses):
</p>

<pre class="example" id="org0000000">
openssl x509 -outform der &lt;mycert.pem | openssl dgst -sha512
</pre>

<p>
there is also a built-in <code>-fingerprint</code> option (use with <code>-sha512</code> etc),
if you do not mind manually removing the colons.
</p>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> spki fingerprints</h2>
<div class="outline-text-2" id="text-2">
<p>
spki_sha256, spki_sha512 fingerprints are hashes of the subject and
public key part of a cert, so that when expiring they can be renewed
without changing the fingerprint. for example to get the spki_sha256
fingerprint (this is what replirc uses):
</p>

<pre class="example" id="org0000001">
openssl x509 -noout -pubkey &lt;mycert.pem | openssl pkey -pubin -outform der | openssl dgst -sha256  
</pre>

<p>
note that this outputs the fingerprint as <i>hex</i>, since this is what
irc stuff does. spki fingerprints when used <i>outside of irc</i> are
usually base64 encoded, ie adding <code>-binary</code> to the <code>openssl dgst</code> and
piping that into <code>base64</code>
</p>
</div>
</div>
</div>
</body>
</html>